<template>
  <div class="container mx-auto !pb-10">
    <AppBreadcrubs
      v-if="!mainStore.isMobile"
      :links="links"
      class="my-5"
    />
    <h1
      class="ui-text-ru-title-2 my-6"
      :class="{ 'ui-text-ru-title-3': useMainStore().isMobile }"
    >
      Политика конфиденциальности
    </h1>
    <div
      class="flex w-full"
      :class="{ '!block': mainStore.isMobile }"
    >
      <div class="page__subtitle w-full">
        <p class="ui-text-ru-caption-1">
          Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в
          отношении всех продуктов, расположенных на доменном имени www.flor2u.ru.<br />
          В настоящей Политике конфиденциальности используются следующие термины:
        </p>
        <p
          id="policy-1"
          class="ui-text-ru-title-5 !font-semibold"
        >
          1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ
        </p>
        <p class="ui-text-ru-caption-1">
          1.1. <b>«Администрация сайта Flor2u (далее – Администрация)»</b> – уполномоченные сотрудники на управления
          сайтом и приложением, действующие от имени компании которые организуют и (или) осуществляют обработку
          персональных данных, а также определяют цели обработки персональных данных, состав персональных данных,
          подлежащих обработке, действия (операции), совершаемые с персональными данными.
        </p>

        <p class="ui-text-ru-caption-1">
          1.2. <b>«Персональные данные»</b> - любая информация, относящаяся к прямо или косвенно определенному или
          определяемому физическому лицу (субъекту персональных данных).
        </p>

        <p class="ui-text-ru-caption-1">
          1.3. <b>«Обработка персональных данных»</b> - любое действие (операция) или совокупность действий (операций),
          совершаемых с использованием средств автоматизации или без использования таких средств с персональными
          данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),
          извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование,
          удаление, уничтожение персональных данных.
        </p>

        <p class="ui-text-ru-caption-1">
          1.4. <b>«Конфиденциальность персональных данных»</b> - обязательное для соблюдения получившим доступ к
          персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных
          или наличия иного законного основания.
        </p>
        <p class="ui-text-ru-caption-1">
          1.5. <b>«Пользователь сайта или приложения Flor2u (далее - Пользователь)»</b> – лицо, имеющее доступ к Сайту
          или Приложению, посредством сети Интернет.
        </p>

        <p
          id="policy-2"
          class="ui-text-ru-title-5 !font-semibold"
        >
          2. ОБЩИЕ ПОЛОЖЕНИЯ
        </p>
        <p class="ui-text-ru-caption-1">
          2.1. Использование Пользователем сайта или приложения Flor2u означает согласие с настоящей Политикой
          конфиденциальности и условиями обработки персональных данных Пользователя.
        </p>

        <p class="ui-text-ru-caption-1">
          2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование
          сайта и приложения Flor2u.
        </p>
        <p class="ui-text-ru-caption-1">
          2.3. Настоящая Политика конфиденциальности применяется только к сайту и приложению Flor2u. 2.4. Администрация
          не проверяет достоверность персональных данных, предоставляемых Пользователем Flor2u.
        </p>
        <p class="ui-text-ru-caption-1">
          2.4. Администрация не обрабатывает Персональные данные, относящиеся к специальным категориям и касающиеся
          расовой и национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния
          здоровья, интимной жизни Субъекта персональных данных, о членстве Субъекта персональных данных в общественных
          объединениях, за исключением случаев, прямо предусмотренных Законодательством.
        </p>
        <p class="ui-text-ru-caption-1">
          2.5. Администрация обрабатывает Персональные данные исключительно в целях исполнения договорных обязательств
          перед Пользователем.
        </p>

        <p
          id="policy-3"
          class="ui-text-ru-title-5 !font-semibold"
        >
          3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
        </p>
        <p class="ui-text-ru-caption-1">
          3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и
          обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по
          запросу Администрации.
        </p>

        <p class="ui-text-ru-caption-1">
          3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности,
          предоставляются Пользователем запросу Администрации и включают в себя следующую информацию:
        </p>
        <p class="ui-text-ru-caption-1">3.3. Фамилию, Имя, Отчество;</p>
        <p class="ui-text-ru-caption-1">3.4. Адрес</p>
        <p class="ui-text-ru-caption-1">3.5. Предпочитаемый способ для коммуникации: скайп\телефон\e-mail</p>
        <p class="ui-text-ru-caption-1">
          3.6. Данные банковской карты, с которой осуществляется оплата (наименование держателя банковской карты, номер
          карты, CVV код);
        </p>
        <p class="ui-text-ru-caption-1">3.7. IP адрес Пользователя;</p>
        <p class="ui-text-ru-caption-1">3.8. Тип браузера Пользователя;</p>
        <p class="ui-text-ru-caption-1">
          3.9. Адрес доставки товаров, адрес оплаты (в случае оплаты по другому адресу)
        </p>
        <p class="ui-text-ru-caption-1">3.10. Администрация защищает Данные, предоставляемые пользователем</p>

        <p
          id="policy-4"
          class="ui-text-ru-title-5 !font-semibold"
        >
          4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
        </p>
        <p class="ui-text-ru-caption-1">
          4.1. Персональные данные Пользователя Администрация может использовать в целях:
        </p>
        <p class="ui-text-ru-caption-1">4.2. Подтверждения личности Пользователя.</p>
        <p class="ui-text-ru-caption-1">4.3. Установления с Пользователем обратной связи.</p>
        <p class="ui-text-ru-caption-1">4.4. Для обеспечения безопасности, предотвращения мошенничества.</p>
        <p class="ui-text-ru-caption-1">4.5. Для осуществления доставки заказов Пользователя.</p>
        <p class="ui-text-ru-caption-1">
          4.6. Для предоставления скидок/бонусов/акций в рамках работы Flor2u. По средствам смс, email рассылок и
          уведомлений.
        </p>
        <p class="ui-text-ru-caption-1">
          4.7. Выполнения обязательств Оператора перед Пользователем по продаже товаров, в том числе обработку платежей,
          доставку товаров.
        </p>
        <p class="ui-text-ru-caption-1">
          4.8. Для связи с Пользователями в случае необходимости, в том числе для направления уведомлений, информации и
          запросов, связанных с оказанием услуг, а также обработки заявлений, запросов и заявок Пользователей;
        </p>
        <p class="ui-text-ru-caption-1">4.9. Для улучшения качества услуг, оказываемых Администрацией;</p>
        <p class="ui-text-ru-caption-1">
          4.10. Для продвижения услуг на рынке путем осуществления прямых контактов с Пользователями;
        </p>
        <p class="ui-text-ru-caption-1">
          4.11. Для проведения статистических и иных исследований на основе обезличенных персональных данных.
        </p>
        <p class="ui-text-ru-caption-1">
          4.12. Администрация передает обработанную информацию транспортным (курьерским) компаниям на основании согласия
          Пользователя (ст. 9 ФЗ «О персональных данных»).
        </p>

        <p
          id="policy-5"
          class="ui-text-ru-title-5 !font-semibold"
        >
          5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
        </p>
        <p class="ui-text-ru-caption-1">
          5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом.
        </p>
        <p class="ui-text-ru-caption-1">
          5.2. Пользователь соглашается с тем, что Администрация вправе передавать персональные данные третьим лицам в
          рамках рабочего процесса – доставки подарков Пользователю, оказания поддержки в работе с сайтом, решения
          конфликтных ситуаций, Партнёрам c целью выполнения договорных обязательств перед Пользователем.
        </p>
        <p class="ui-text-ru-caption-1">
          5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти
          Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
        </p>
        <p class="ui-text-ru-caption-1">
          5.4. При утрате или разглашении персональных данных Администрация информирует Пользователя об утрате или
          разглашении персональных данных.
        </p>
        <p class="ui-text-ru-caption-1">
          5.5. Администрация принимает необходимые организационные и технические меры для защиты персональной информации
          Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования,
          распространения, а также от иных неправомерных действий третьих лиц.
        </p>
        <p class="ui-text-ru-caption-1">
          5.6. Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных
          отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.
        </p>

        <p
          id="policy-6"
          class="ui-text-ru-title-5 !font-semibold"
        >
          6. ОБЯЗАТЕЛЬСТВА СТОРОН
        </p>
        <p class="ui-text-ru-caption-1">6.1. Пользователь обязан:</p>
        <p class="ui-text-ru-caption-1">6.2. Предоставить информацию о персональных данных, указанных в п 3.2..</p>
        <p class="ui-text-ru-caption-1">
          6.3. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной
          информации.
        </p>
        <p class="ui-text-ru-caption-1">6.4. Администрация обязана:</p>
        <p class="ui-text-ru-caption-1">
          6.5. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики
          конфиденциальности.
        </p>
        <p class="ui-text-ru-caption-1">
          6.6. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного
          разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными
          возможными способами переданных персональных данных Пользователя, за исключением случаев оговоренных в
          настоящей Политики Конфиденциальности.
        </p>

        <p class="ui-text-ru-caption-1">
          6.7. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно
          порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.
        </p>
        <p class="ui-text-ru-caption-1">
          6.8. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента
          обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав
          субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или
          неправомерных действий.
        </p>

        <p
          id="policy-7"
          class="ui-text-ru-title-5 !font-semibold"
        >
          7. ПЕРСОНАЛЬНЫЕ ДАННЫЕ ТРЕТЬИХ ЛИЦ, ИСПОЛЬЗУЕМЫЕ ПОЛЬЗОВАТЕЛЯМИ
        </p>
        <p class="ui-text-ru-caption-1">
          7.1. Используя Сайт, Пользователь имеет право заносить данные третьих лиц для заказа товаров.
        </p>
        <p class="ui-text-ru-caption-1">
          7.2. Пользователь обязуется получить предварительное согласие субъекта Персональных данных на их использование
          посредством Сайта. Пользователь самостоятельно несет ответственность за отсутствие такого согласия.
        </p>
        <p class="ui-text-ru-caption-1">
          7.3. Оператор обязуется предпринять необходимые меры для обеспечения сохранности Персональных данных третьих
          лиц, занесённых Пользователем.
        </p>

        <p
          id="policy-8"
          class="ui-text-ru-title-5 !font-semibold"
        >
          8. РАЗРЕШЕНИЕ СПОРОВ
        </p>
        <p class="ui-text-ru-caption-1">
          8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем приложения и
          Администрацией, обязательным является предъявление претензии (письменного предложения о добровольном
          урегулировании спора).
        </p>
        <p class="ui-text-ru-caption-1">
          8.2. Получатель претензии в течение 90 календарных дней со дня получения претензии, письменно уведомляет
          заявителя претензии о результатах рассмотрения претензии.
        </p>
        <p class="ui-text-ru-caption-1">
          8.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с
          действующим законодательством Российской Федерации.
        </p>
        <p class="ui-text-ru-caption-1">
          8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта
          применяется действующее законодательство Российской Федерации.
        </p>

        <p
          id="policy-9"
          class="ui-text-ru-title-5 !font-semibold"
        >
          9. СОГЛАСИЕ ПОЛЬЗОВАТЕЛЯ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ
        </p>
        <p class="ui-text-ru-caption-1">
          9.1. Пользователь принимает решение о предоставлении своих Персональных данных Администрации и даёт согласие
          на их обработку свободно, своей волей и в своём интересе. Согласие на обработку Персональных данных должно
          быть конкретным, информированным и сознательным и предоставляется Пользователем в момент его Регистрации на
          Сайте Администрации, а также в любой позволяющей подтвердить факт его получения форме, если иное не
          установлено Законодательством.
        </p>
        <p class="ui-text-ru-caption-1">
          9.2. Персональные данные лиц, вступивших в договорные обязательства с Администрацией, содержащиеся в единых
          государственных реестрах юридических лиц и индивидуальных предпринимателей, являются открытыми и
          общедоступными, за исключением сведений о номере, дате выдачи и органе, выдавшем документ, удостоверяющий
          личность физического лица. Охраны их конфиденциальности и согласия Пользователей на обработку не требуется.
        </p>

        <p
          id="policy-10"
          class="ui-text-ru-title-5 !font-semibold"
        >
          10. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
        </p>
        <p class="ui-text-ru-caption-1">
          10.1. Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия
          Пользователя.
        </p>
        <p class="ui-text-ru-caption-1">
          10.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте www.flor2u.ru, если
          иное не предусмотрено новой редакцией Политики конфиденциальности.
        </p>
        <p class="ui-text-ru-caption-1">
          10.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать через электронную
          почту, указанную на сайте.
        </p>

        <p
          id="policy-11"
          class="ui-text-ru-title-5 !font-semibold"
        >
          11. СОГЛАСИЕ НА ПОЛУЧЕНИЕ СМС И EMAIL РАССЫЛКИ
        </p>
        <p class="ui-text-ru-caption-1">
          Нажимая кнопку «далее» в корзине сайта, клиент подтверждает следующее и дает свое согласие на участие в смс и
          email рассылке:
        </p>
        <p class="ui-text-ru-caption-1">
          1. Подтверждаю, что введенные мной данные (фамилия, имя, отчество, электронный адрес, телефон) являются
          корректными;
        </p>
        <p class="ui-text-ru-caption-1">2. Подтверждаю, что все данные предоставляются добровольно;</p>
        <p class="ui-text-ru-caption-1">
          3. Выражаю полное и безоговорочное согласие на использование моих данных для поддержания связи со мной любым
          способом, включая телефонные звонки на указанный стационарный и/или мобильный телефон, отправку СМС-сообщений
          на указанный мобильный телефон, отправку электронных писем на указанный электронный адрес с целью
          информирования о поступлении новых товаров/услуг, оповещения о проводимых акциях, мероприятиях, скидках, их
          результатах. Для осуществления заочных опросов с целью изучения мнения о товарах/услугах, организациях
          торговли, высылки новостей и т.п. Согласие предоставляется
        </p>
        <p
          id="policy-12"
          class="ui-text-ru-title-5 !font-semibold"
        >
          12. УДАЛЕНИЕ АККАУНТА И СВЯЗАННЫХ С НИМ ДАННЫХ
        </p>
        <p class="ui-text-ru-caption-1">
          1. Для удаления аккаунта и связанных с ним данных, пользователю нужно авторизоваться в мобильном приложении,
          перейти в профиль, выбрать пункт "удалить профиль".
        </p>

        <p class="ui-text-ru-caption-1">ООО "ПЕРСПЕКТИВА" (ОГРН 1207800078210 ИНН 7842182026)</p>
        <p class="ui-text-ru-caption-1">
          мной бессрочно. Я проинформирован о том, что согласие может быть отозвано в любой момент путем:
        </p>
        <p class="ui-text-ru-caption-1">
          1. Направления письменного уведомления по адресу: 115093, Москва г, ул. Павловская дом 27/29
        </p>
        <p class="ui-text-ru-caption-1">
          2. Направления электронного письма на адрес:
          <a
            href="mailto:zabota@flor2u.ru"
            class="text-primary cp"
          >
            zabota@flor2u.ru</a
          >;
        </p>
        <p class="ui-text-ru-caption-1">
          3. Звонка по телефону:<a
            href="tel:+7 (495) 120-65-86"
            class="text-primary cp"
          >
            +7 (495) 120-65-86</a
          >;
        </p>
        <p class="ui-text-ru-caption-1">
          В личном кабинете сайта клиент самостоятельно может отключить все уведомления и рассылки во вкладке «настройка
          уведомлений» сняв галочки напротив нужного – смс или почта.
        </p>
      </div>
      <div
        class="sticky top-0 ml-6 min-w-[311px] self-start"
        :class="{ '!ml-0 !w-full': mainStore.isMobile }"
      >
        <div
          v-if="!mainStore.isMobile"
          class="bg-lightGrey flex w-full flex-col rounded-3xl p-6"
        >
          <h5 class="mb-2">Содержание</h5>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('1')"
          >
            1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('2')"
          >
            2. ОБЩИЕ ПОЛОЖЕНИЯ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('3')"
          >
            3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('4')"
          >
            4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('5')"
          >
            5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('6')"
          >
            6. ОБЯЗАТЕЛЬСТВА СТОРОН
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('7')"
          >
            7. ПЕРСОНАЛЬНЫЕ ДАННЫЕ ТРЕТЬИХ ЛИЦ, ИСПОЛЬЗУЕМЫЕ ПОЛЬЗОВАТЕЛЯМИ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('8')"
          >
            8. РАЗРЕШЕНИЕ СПОРОВ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('9')"
          >
            9. СОГЛАСИЕ ПОЛЬЗОВАТЕЛЯ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('10')"
          >
            10. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('11')"
          >
            11. СОГЛАСИЕ НА ПОЛУЧЕНИЕ СМС И EMAIL РАССЫЛКИ
          </p>
          <p
            class="ui-text-ru-caption-1 text-primary cp mb-2"
            @click="scrollTo('12')"
          >
            12. УДАЛЕНИЕ АККАУНТА И СВЯЗАННЫХ С НИМ ДАННЫХ
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { useMainStore } from '~~/store/main';
const mainStore = useMainStore();

useHead({
  title: 'Политика конфиденциальности',
  meta: [
    { name: 'og:title', content: 'Политика конфиденциальности' },
    { name: 'og:description', content: 'Политика конфиденциальности' },
  ],
});

const links = ref([
  {
    name: 'Главная',
    link: '/',
  },
  {
    name: 'Корпоративным клиентам',
    link: '/',
  },
]);

function scrollTo(id: string) {
  const elem = document.querySelector(`#policy-${id}`);
  if (elem) {
    elem.scrollIntoView({
      behavior: 'smooth',
      block: 'start',
    });
  }
}
</script>

<style scoped lang="scss">
p {
  margin-bottom: 12px;
}
b {
  font-weight: 600 !important;
}

br {
  @include mobile {
    display: none;
  }
}
</style>
